WS-I/BP1.2/Messages/BaseDataTypes/XmlFormatter/RpcLit/SoapWsdl.BaseDataTypes.XmlFormatter.RpcLit_RetLong_Client_Request-2.xml

<s:Envelope xmlns:a="http://www.w3.org/2005/08/addressing" xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Header>
    <a:Action s:mustUnderstand="1">http://tempuri.org/IBaseDataTypesRpcLit/RetLong</a:Action>
    <a:MessageID>urn:uuid:94b54102-366f-49f3-b67d-08d71e4935fb</a:MessageID>
    <a:ReplyTo>
      <a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address>
    </a:ReplyTo>
  </s:Header>
  <s:Body>
    <RetLong xmlns="http://tempuri.org/">
      <inLong xmlns="">-1</inLong>
    </RetLong>
  </s:Body>
</s:Envelope>